Tekla.Structures.ModelInternal.BimModelDataProduct.BaseHttpClient
The base class for HTTP clients used in the BimModelDataProduct.

Tekla.Structures.ModelInternal.BimModelDataProduct.BaseHttpClient.ReportContextSetter
Gets the delegate used to set additional context information for tranos reporting on outgoing HTTP requests.
Default implementation adds session and model session IDs.
Tests should provide a custom header with Tekla.Structures.ModelInternal.BimModelDataProduct.Constants.TestRequestHeaderName, value being true.